#include<iostream.h>
int main()
{
	double a,b1,b2,b3,b4,b5;
	cout<<"请输入利润:"<<endl;
	cin>>a;
	if(a<=100000)
	{
		b1=a*0.1;
		cout<<"奖金是:"<<b1<<endl;
	}
	else if(a<=200000)
	{
		b2=(10*0.1)*((a-10)*0.075);
		cout<<"奖金是:"<<b2<<endl;
	}
	else if(a<=400000)
	{
		b3=(10*0.1)*((a-10)*0.075)+((a-20)*0.05);
		cout<<"奖金是:"<<b3<<endl;
	}
	else if(a<=600000)
	{
		b4=(10*0.1)*((a-10)*0.075)+((a-20)*0.05)+((a-40)*0.03);
		cout<<"奖金是:"<<b4<<endl;
	}
	else
	{
		b5=(10*0.1)*((a-10)*0.075)+((a-20)*0.05)+((a-40)*0.03)+((a-60)*0.01);
		cout<<"奖金是:"<<b5<<endl;
	}
	return 0;
}
